AbdulraufIbrahim/AgroGuard_AI/esp32_cam_disease_intruder/esp32_cam_disease_intruder.ino
#include <Arduino.h>
#include "esp_camera.h"
#include <WiFi.h>
#include <WiFiClientSecure.h>
#include <HTTPClient.h>
#include <ArduinoJson.h>
#include <time.h>
#include "mbedtls/base64.h"
#if __has_include("secrets.h")
#include "secrets.h"
#else
#error "Copy secrets.example.h to secrets.h and fill in your Wi-Fi and Telegram values."
#endif

#ifndef FIREBASE_EMAIL_VALUE
#define FIREBASE_EMAIL_VALUE "ibraniger001@gmail.com"
#endif

#ifndef FIREBASE_PASSWORD_VALUE
#define FIREBASE_PASSWORD_VALUE "oluwaseun"
#endif

// =======================
// WIFI SETTINGS
// =======================
const char* WIFI_SSID = WIFI_SSID_VALUE;
const char* WIFI_PASSWORD = WIFI_PASSWORD_VALUE;

// =======================
// HUGGING FACE API
// =======================
const char* HF_HOST = "AbdulraufIbrahim-plant-disease-api.hf.space";
const char* HF_PATH = "/predict";

// =======================
// TELEGRAM SETTINGS
// =======================
String BOT_TOKEN = TELEGRAM_BOT_TOKEN_VALUE;
String CHAT_ID = TELEGRAM_CHAT_ID_VALUE;

// =======================
// FIREBASE SETTINGS
// =======================
String FIREBASE_URL = "https://plant-disease-dectection-001-default-rtdb.europe-west1.firebasedatabase.app";
String FIREBASE_API_KEY = "AIzaSyCUqBs9NqWzMCWe7PbGgZLhmp85gBhwcoM";
String FIREBASE_EMAIL = FIREBASE_EMAIL_VALUE;
String FIREBASE_PASSWORD = FIREBASE_PASSWORD_VALUE;
String FIREBASE_AUTH = "";
String FIREBASE_REFRESH_TOKEN = "";
unsigned long firebaseTokenExpiresAtMs = 0;

// Set false if the ESP becomes unstable from large image writes.
const bool STORE_IMAGES_IN_RTDB = true;

// Nigeria/Lagos time.
const long GMT_OFFSET_SEC = 3600;
const int DAYLIGHT_OFFSET_SEC = 0;

// =======================
// AI THINKER ESP32-CAM PINS
// =======================
#define PWDN_GPIO_NUM     32
#define RESET_GPIO_NUM    -1
#define XCLK_GPIO_NUM      0
#define SIOD_GPIO_NUM     26
#define SIOC_GPIO_NUM     27
#define Y9_GPIO_NUM       35
#define Y8_GPIO_NUM       34
#define Y7_GPIO_NUM       39
#define Y6_GPIO_NUM       36
#define Y5_GPIO_NUM       21
#define Y4_GPIO_NUM       19
#define Y3_GPIO_NUM       18
#define Y2_GPIO_NUM        5
#define VSYNC_GPIO_NUM    25
#define HREF_GPIO_NUM     23
#define PCLK_GPIO_NUM     22

// External components.
#define PIR_PIN           13
#define BUZZER_PIN        12
#define FLASH_LED_PIN      4

unsigned long lastCommandPoll = 0;
unsigned long commandPollInterval = 3000;

bool dailyDiseaseActive = false;
String dailyDiseaseTimes = "";
String lastSnapDate = "";
String lastSnapTimeStr = "";

bool intruderArmed = false;
unsigned long lastIntruderSnap = 0;
unsigned long intruderCooldownMs = 10000;

String jsonEscape(String value) {
  value.replace("\\", "\\\\");
  value.replace("\"", "\\\"");
  value.replace("\n", "\\n");
  value.replace("\r", "\\r");
  value.replace("\t", "\\t");
  return value;
}

void soundBuzzer(int pin, int times, int delayMs) {
  for (int i = 0; i < times; i++) {
    digitalWrite(pin, HIGH);
    delay(delayMs);
    digitalWrite(pin, LOW);
    delay(delayMs);
  }
}

String getTimestampString() {
  time_t now = time(nullptr);
  if (now < 100000) return String(millis());

  struct tm* timeinfo = localtime(&now);
  char buffer[30];
  strftime(buffer, sizeof(buffer), "%Y-%m-%d %H:%M:%S", timeinfo);
  return String(buffer);
}

String getTimestampKey() {
  time_t now = time(nullptr);
  if (now < 100000) return String(millis());
  return String((unsigned long)now);
}

String firebaseUrl(String path) {
  String url = FIREBASE_URL + path + ".json";
  if (FIREBASE_AUTH.length() > 0) {
    url += "?auth=" + FIREBASE_AUTH;
  }
  return url;
}

bool firebaseSignIn() {
  if (FIREBASE_EMAIL.length() == 0 || FIREBASE_PASSWORD.length() == 0 ||
      FIREBASE_EMAIL == "your-firebase-email@example.com" ||
      FIREBASE_PASSWORD == "your-firebase-password") {
    Serial.println("Firebase auth skipped: fill FIREBASE_EMAIL_VALUE and FIREBASE_PASSWORD_VALUE in secrets.h.");
    return false;
  }

  WiFiClientSecure client;
  client.setInsecure();

  HTTPClient http;
  String url = "https://identitytoolkit.googleapis.com/v1/accounts:signInWithPassword?key=" + FIREBASE_API_KEY;

  http.begin(client, url);
  http.addHeader("Content-Type", "application/json");

  String body = "{";
  body += "\"email\":\"" + jsonEscape(FIREBASE_EMAIL) + "\",";
  body += "\"password\":\"" + jsonEscape(FIREBASE_PASSWORD) + "\",";
  body += "\"returnSecureToken\":true";
  body += "}";

  int code = http.POST(body);
  String payload = http.getString();
  http.end();

  if (code != 200) {
    Serial.printf("Firebase sign-in failed: HTTP %d\n", code);
    if (payload.length() > 0) Serial.println(payload);
    FIREBASE_AUTH = "";
    firebaseTokenExpiresAtMs = 0;
    return false;
  }

  StaticJsonDocument<6144> doc;
  DeserializationError error = deserializeJson(doc, payload);
  if (error) {
    Serial.print("Firebase sign-in JSON parse failed: ");
    Serial.println(error.c_str());
    FIREBASE_AUTH = "";
    firebaseTokenExpiresAtMs = 0;
    return false;
  }

  FIREBASE_AUTH = String(doc["idToken"] | "");
  FIREBASE_REFRESH_TOKEN = String(doc["refreshToken"] | "");
  unsigned long expiresInSec = String(doc["expiresIn"] | "3600").toInt();

  if (FIREBASE_AUTH.length() == 0) {
    Serial.println("Firebase sign-in failed: missing idToken.");
    firebaseTokenExpiresAtMs = 0;
    return false;
  }

  unsigned long usableTokenMs = expiresInSec > 300 ? (expiresInSec - 300) * 1000UL : expiresInSec * 1000UL;
  firebaseTokenExpiresAtMs = millis() + usableTokenMs;

  Serial.println("Firebase sign-in successful.");
  return true;
}

bool firebaseEnsureAuth() {
  if (FIREBASE_AUTH.length() > 0 && (long)(firebaseTokenExpiresAtMs - millis()) > 0) {
    return true;
  }

  return firebaseSignIn();
}

String firebaseGET(String path) {
  if (!firebaseEnsureAuth()) {
    Serial.printf("Firebase GET skipped %s: not authenticated\n", path.c_str());
    return "";
  }

  WiFiClientSecure client;
  client.setInsecure();

  HTTPClient http;
  http.begin(client, firebaseUrl(path));
  int code = http.GET();

