AbdulraufIbrahim/AgroGuard_AI/esp32_cam_disease_intruder/esp32_cam_disease_intruder.ino
  if (code == 401 || code == 403) {
    http.end();
    FIREBASE_AUTH = "";
    firebaseTokenExpiresAtMs = 0;

    if (!firebaseEnsureAuth()) {
      Serial.printf("Firebase GET retry skipped %s: re-auth failed\n", path.c_str());
      return "";
    }

    http.begin(client, firebaseUrl(path));
    code = http.GET();
  }

  String payload = "";
  if (code >= 200 && code < 300) {
    payload = http.getString();
  } else {
    Serial.printf("Firebase GET failed %s: HTTP %d\n", path.c_str(), code);
    String err = http.getString();
    if (err.length() > 0) Serial.println(err);
  }

  http.end();
  return payload;
}

bool firebasePUT(String path, String json) {
  if (!firebaseEnsureAuth()) {
    Serial.printf("Firebase PUT skipped %s: not authenticated\n", path.c_str());
    return false;
  }

  WiFiClientSecure client;
  client.setInsecure();

  HTTPClient http;
  http.begin(client, firebaseUrl(path));
  http.addHeader("Content-Type", "application/json");
  int code = http.PUT(json);

  if (code == 401 || code == 403) {
    http.end();
    FIREBASE_AUTH = "";
    firebaseTokenExpiresAtMs = 0;

    if (!firebaseEnsureAuth()) {
      Serial.printf("Firebase PUT retry skipped %s: re-auth failed\n", path.c_str());
      return false;
    }

    http.begin(client, firebaseUrl(path));
    http.addHeader("Content-Type", "application/json");
    code = http.PUT(json);
  }

  if (code < 200 || code >= 300) {
    Serial.printf("Firebase PUT failed %s: HTTP %d\n", path.c_str(), code);
    String err = http.getString();
    if (err.length() > 0) Serial.println(err);
  }

  http.end();
  return code >= 200 && code < 300;
}

bool firebaseSetBool(String path, bool value) {
  return firebasePUT(path, value ? "true" : "false");
}

bool firebaseSetString(String path, String value) {
  return firebasePUT(path, "\"" + jsonEscape(value) + "\"");
}

bool firebaseGetBool(String path, bool defaultValue) {
  String payload = firebaseGET(path);
  payload.trim();
  if (payload == "true") return true;
  if (payload == "false") return false;
  return defaultValue;
}

String encodeBase64(uint8_t* data, size_t length) {
  size_t outputLength = 0;
  mbedtls_base64_encode(nullptr, 0, &outputLength, data, length);

  unsigned char* base64Buffer = (unsigned char*)malloc(outputLength + 1);
  if (!base64Buffer) {
    Serial.println("Base64 malloc failed.");
    return "";
  }

  int ret = mbedtls_base64_encode(base64Buffer, outputLength, &outputLength, data, length);
  if (ret != 0) {
    Serial.printf("Base64 encode failed: %d\n", ret);
    free(base64Buffer);
    return "";
  }

  base64Buffer[outputLength] = '\0';
  String result = String((char*)base64Buffer);
  free(base64Buffer);
  return result;
}

void decodeBase64(String base64Str, uint8_t** buffer, size_t* length) {
  *buffer = nullptr;
  *length = 0;

  int commaIndex = base64Str.indexOf(",");
  if (commaIndex >= 0) {
    base64Str = base64Str.substring(commaIndex + 1);
  }

  base64Str.trim();

  size_t outputLength = 0;
  int ret = mbedtls_base64_decode(
    nullptr,
    0,
    &outputLength,
    (const unsigned char*)base64Str.c_str(),
    base64Str.length()
  );

  if (ret != MBEDTLS_ERR_BASE64_BUFFER_TOO_SMALL && ret != 0) {
    Serial.printf("Base64 decode size check failed: %d\n", ret);
    return;
  }

  *buffer = (uint8_t*)malloc(outputLength);
  if (!*buffer) {
    Serial.println("Base64 decode malloc failed.");
    return;
  }

  ret = mbedtls_base64_decode(
    *buffer,
    outputLength,
    &outputLength,
    (const unsigned char*)base64Str.c_str(),
    base64Str.length()
  );

  if (ret != 0) {
    Serial.printf("Base64 decode failed: %d\n", ret);
    free(*buffer);
    *buffer = nullptr;
    *length = 0;
    return;
  }

  *length = outputLength;
}

String dechunkBody(String body) {
  String decoded = "";
  int index = 0;

  while (index < body.length()) {
    int lineEnd = body.indexOf("\r\n", index);
    if (lineEnd < 0) break;

    String sizeStr = body.substring(index, lineEnd);
    sizeStr.trim();
    int semi = sizeStr.indexOf(";");
    if (semi >= 0) sizeStr = sizeStr.substring(0, semi);

    int chunkSize = strtol(sizeStr.c_str(), nullptr, 16);
    if (chunkSize <= 0) break;

    index = lineEnd + 2;
    if (index + chunkSize > body.length()) break;

    decoded += body.substring(index, index + chunkSize);
    index += chunkSize + 2;
  }

  return decoded.length() > 0 ? decoded : body;
}

String extractHttpBody(String response) {
  bool chunked = response.indexOf("Transfer-Encoding: chunked") >= 0 ||
                 response.indexOf("transfer-encoding: chunked") >= 0;

  int bodyIndex = response.indexOf("\r\n\r\n");
  if (bodyIndex >= 0) response = response.substring(bodyIndex + 4);
  if (chunked) response = dechunkBody(response);

  response.trim();
  return response;
}

void connectWiFi() {
  Serial.print("Connecting to WiFi: ");
  Serial.println(WIFI_SSID);

  WiFi.mode(WIFI_STA);
  WiFi.begin(WIFI_SSID, WIFI_PASSWORD);

  int tries = 0;
  while (WiFi.status() != WL_CONNECTED) {
    delay(500);
    Serial.print(".");
    tries++;
    if (tries > 60) {
      Serial.println("\nWiFi connection failed. Restarting...");
      ESP.restart();
    }
  }

  Serial.println("\nWiFi connected.");
  Serial.print("IP: ");
  Serial.println(WiFi.localIP());
}

void setupTime() {
  configTime(GMT_OFFSET_SEC, DAYLIGHT_OFFSET_SEC, "pool.ntp.org", "time.nist.gov");

  Serial.print("Syncing time");
  int tries = 0;
  while (time(nullptr) < 100000 && tries < 30) {
    Serial.print(".");
    delay(500);
    tries++;
  }
  Serial.println();

  if (time(nullptr) < 100000) {
    Serial.println("Time sync failed.");
  } else {
    Serial.print("Time synced: ");
    Serial.println(getTimestampString());
  }
}

void updateDeviceStatus(String message) {
  String json = "{";
  json += "\"message\":\"" + jsonEscape(message) + "\",";
  json += "\"timestamp\":\"" + jsonEscape(getTimestampString()) + "\",";
  json += "\"timestampEpoch\":" + String((unsigned long)time(nullptr));
  json += "}";
  firebasePUT("/status/latest", json);
}

