AbdulraufIbrahim/AgroGuard_AI/esp32_cam_disease_intruder/esp32_cam_disease_intruder.ino
void setupCamera() {
  // Important for 0x106 ESP_ERR_NOT_SUPPORTED on some modules.
  pinMode(PWDN_GPIO_NUM, OUTPUT);
  digitalWrite(PWDN_GPIO_NUM, HIGH);
  delay(20);
  digitalWrite(PWDN_GPIO_NUM, LOW);
  delay(200);

  camera_config_t config;
  config.ledc_channel = LEDC_CHANNEL_0;
  config.ledc_timer = LEDC_TIMER_0;
  config.pin_d0 = Y2_GPIO_NUM;
  config.pin_d1 = Y3_GPIO_NUM;
  config.pin_d2 = Y4_GPIO_NUM;
  config.pin_d3 = Y5_GPIO_NUM;
  config.pin_d4 = Y6_GPIO_NUM;
  config.pin_d5 = Y7_GPIO_NUM;
  config.pin_d6 = Y8_GPIO_NUM;
  config.pin_d7 = Y9_GPIO_NUM;
  config.pin_xclk = XCLK_GPIO_NUM;
  config.pin_pclk = PCLK_GPIO_NUM;
  config.pin_vsync = VSYNC_GPIO_NUM;
  config.pin_href = HREF_GPIO_NUM;

#if defined(ESP_ARDUINO_VERSION_MAJOR) && ESP_ARDUINO_VERSION_MAJOR >= 3
  config.pin_sccb_sda = SIOD_GPIO_NUM;
  config.pin_sccb_scl = SIOC_GPIO_NUM;
#else
  config.pin_sscb_sda = SIOD_GPIO_NUM;
  config.pin_sscb_scl = SIOC_GPIO_NUM;
#endif

  config.pin_pwdn = PWDN_GPIO_NUM;
  config.pin_reset = RESET_GPIO_NUM;
  config.xclk_freq_hz = 20000000;
  config.pixel_format = PIXFORMAT_JPEG;
  config.frame_size = FRAMESIZE_QVGA;
  config.jpeg_quality = 12;
  config.fb_count = 1;

  if (psramFound()) {
    config.fb_count = 2;
    config.grab_mode = CAMERA_GRAB_LATEST;
  }

  esp_err_t err = esp_camera_init(&config);
  if (err != ESP_OK) {
    Serial.printf("Camera init failed at 20 MHz: 0x%x\n", err);
    Serial.println("Retrying camera init at 10 MHz...");
    config.xclk_freq_hz = 10000000;
    delay(200);
    err = esp_camera_init(&config);
  }

  if (err != ESP_OK) {
    Serial.printf("Camera init failed: 0x%x\n", err);
    Serial.println("Check board: AI Thinker ESP32-CAM, PSRAM enabled if available, stable 5V power, camera ribbon orientation, and camera module seating.");
    updateDeviceStatus("Camera init failed");
    while (true) {
      soundBuzzer(BUZZER_PIN, 1, 300);
    }
  }

  sensor_t* sensor = esp_camera_sensor_get();
  if (sensor) {
    sensor->set_framesize(sensor, FRAMESIZE_QVGA);
    sensor->set_quality(sensor, 12);
  }

  Serial.println("Camera initialized.");
}

String postImageToHuggingFace(uint8_t* buf, size_t len) {
  WiFiClientSecure client;
  client.setInsecure();

  if (!client.connect(HF_HOST, 443)) {
    Serial.println("HF connection failed.");
    return "";
  }

  String boundary = "----ESP32CAMDiseaseBoundary";
  String head = "--" + boundary + "\r\n";
  head += "Content-Disposition: form-data; name=\"file\"; filename=\"plant.jpg\"\r\n";
  head += "Content-Type: image/jpeg\r\n\r\n";

  String tail = "\r\n--" + boundary + "--\r\n";
  int contentLength = head.length() + len + tail.length();

  client.print("POST ");
  client.print(HF_PATH);
  client.println(" HTTP/1.1");
  client.print("Host: ");
  client.println(HF_HOST);
  client.println("Connection: close");
  client.print("Content-Type: multipart/form-data; boundary=");
  client.println(boundary);
  client.print("Content-Length: ");
  client.println(contentLength);
  client.println();

  client.print(head);
  client.write(buf, len);
  client.print(tail);

  String response = "";
  unsigned long timeout = millis();
  while (client.connected() && millis() - timeout < 30000) {
    while (client.available()) {
      response += (char)client.read();
      timeout = millis();
    }
    delay(1);
  }
  while (client.available()) response += (char)client.read();

  client.stop();
  return extractHttpBody(response);
}

String sendDownloadedImageToHuggingFace(uint8_t* buf, size_t len) {
  return postImageToHuggingFace(buf, len);
}

bool sendTelegramMessage(String message) {
  WiFiClientSecure client;
  client.setInsecure();

  HTTPClient http;
  String url = "https://api.telegram.org/bot" + BOT_TOKEN + "/sendMessage";
  http.begin(client, url);
  http.addHeader("Content-Type", "application/json");

  String json = "{\"chat_id\":\"" + jsonEscape(CHAT_ID) + "\",\"text\":\"" + jsonEscape(message) + "\"}";
  int code = http.POST(json);

  if (code != 200) Serial.printf("Telegram message failed: HTTP %d\n", code);
  http.end();
  return code == 200;
}

bool sendTelegramPhoto(camera_fb_t* fb, String caption) {
  WiFiClientSecure client;
  client.setInsecure();

  if (!client.connect("api.telegram.org", 443)) {
    Serial.println("Telegram connection failed.");
    return false;
  }

  String path = "/bot" + BOT_TOKEN + "/sendPhoto";
  String boundary = "----ESP32CAMIntruderBoundary";

  String head = "--" + boundary + "\r\n";
  head += "Content-Disposition: form-data; name=\"chat_id\"\r\n\r\n";
  head += CHAT_ID + "\r\n";
  head += "--" + boundary + "\r\n";
  head += "Content-Disposition: form-data; name=\"caption\"\r\n\r\n";
  head += caption + "\r\n";
  head += "--" + boundary + "\r\n";
  head += "Content-Disposition: form-data; name=\"photo\"; filename=\"intruder.jpg\"\r\n";
  head += "Content-Type: image/jpeg\r\n\r\n";

  String tail = "\r\n--" + boundary + "--\r\n";
  int contentLength = head.length() + fb->len + tail.length();

  client.print("POST ");
  client.print(path);
  client.println(" HTTP/1.1");
  client.println("Host: api.telegram.org");
  client.println("Connection: close");
  client.print("Content-Type: multipart/form-data; boundary=");
  client.println(boundary);
  client.print("Content-Length: ");
  client.println(contentLength);
  client.println();

  client.print(head);
  client.write(fb->buf, fb->len);
  client.print(tail);

  String response = "";
  unsigned long timeout = millis();
  while (client.connected() && millis() - timeout < 30000) {
    while (client.available()) {
      response += (char)client.read();
      timeout = millis();
    }
    delay(1);
  }
  while (client.available()) response += (char)client.read();

  client.stop();
  bool ok = response.indexOf("\"ok\":true") >= 0;
  if (!ok) {
    Serial.println("Telegram photo failed.");
    Serial.println(response);
  }
  return ok;
}

void runDiseaseDetection(String source) {
  updateDeviceStatus("Capturing plant image for disease detection");

