AbdulraufIbrahim/AgroGuard_AI/esp32_cam_disease_intruder/esp32_cam_disease_intruder.ino
  digitalWrite(FLASH_LED_PIN, HIGH);
  delay(200);
  camera_fb_t* fb = esp_camera_fb_get();
  digitalWrite(FLASH_LED_PIN, LOW);

  if (!fb) {
    updateDeviceStatus("Plant image capture failed");
    return;
  }

  String response = postImageToHuggingFace(fb->buf, fb->len);
  String base64Img = "";
  if (STORE_IMAGES_IN_RTDB && source == "manual") {
    base64Img = encodeBase64(fb->buf, fb->len);
  }

  esp_camera_fb_return(fb);

  if (response.length() == 0) {
    updateDeviceStatus("Disease API failed");
    sendTelegramMessage("Disease detection failed: no response from cloud API.");
    return;
  }

  Serial.println("HF response body:");
  Serial.println(response);

  StaticJsonDocument<8192> doc;
  DeserializationError error = deserializeJson(doc, response);
  if (error) {
    updateDeviceStatus("Disease result JSON parse failed");
    Serial.print("JSON parse error: ");
    Serial.println(error.c_str());
    return;
  }

  String label = doc["label"] | "unknown";
  float confidence = doc["confidence"] | 0.0;
  String timestamp = getTimestampString();

  String diseaseJson = "{";
  diseaseJson += "\"label\":\"" + jsonEscape(label) + "\",";
  diseaseJson += "\"confidence\":" + String(confidence, 6) + ",";
  diseaseJson += "\"source\":\"" + jsonEscape(source) + "\",";
  diseaseJson += "\"timestamp\":\"" + jsonEscape(timestamp) + "\"";
  if (base64Img.length() > 0) diseaseJson += ",\"imageBase64\":\"" + base64Img + "\"";
  diseaseJson += "}";

  String tsKey = getTimestampKey();
  firebasePUT("/disease/latest", diseaseJson);
  firebasePUT("/disease/history/" + tsKey, diseaseJson);

  String msg = "Plant Disease Detection Result\n";
  msg += "Label: " + label + "\n";
  msg += "Confidence: " + String(confidence, 4) + "\n";
  msg += "Source: " + source + "\n";
  msg += "Time: " + timestamp;
  sendTelegramMessage(msg);

  updateDeviceStatus("Disease detection completed: " + label);
}

void captureIntruder(String source) {
  updateDeviceStatus("Capturing intruder image");
  soundBuzzer(BUZZER_PIN, 5, 200);

  digitalWrite(FLASH_LED_PIN, HIGH);
  delay(300);
  camera_fb_t* fb = esp_camera_fb_get();
  digitalWrite(FLASH_LED_PIN, LOW);

  if (!fb) {
    updateDeviceStatus("Intruder image capture failed");
    return;
  }

  String timestamp = getTimestampString();
  String caption = "Intruder Alert!\nSource: " + source + "\nTime: " + timestamp;
  bool telegramSent = sendTelegramPhoto(fb, caption);

  String base64Image = "";
  if (STORE_IMAGES_IN_RTDB) {
    base64Image = encodeBase64(fb->buf, fb->len);
  }

  esp_camera_fb_return(fb);

  String intruderJson = "{";
  intruderJson += "\"event\":\"intruder_capture\",";
  intruderJson += "\"source\":\"" + jsonEscape(source) + "\",";
  intruderJson += "\"telegramSent\":" + String(telegramSent ? "true" : "false") + ",";
  intruderJson += "\"timestamp\":\"" + jsonEscape(timestamp) + "\"";
  if (base64Image.length() > 0) intruderJson += ",\"imageBase64\":\"" + base64Image + "\"";
  intruderJson += "}";

  String tsKey = getTimestampKey();
  firebasePUT("/intruder/latest", intruderJson);
  firebasePUT("/intruder/history/" + tsKey, intruderJson);

  updateDeviceStatus("Intruder image processed");
}

void processManualPlantUploadBase64(String base64Str) {
  updateDeviceStatus("Decoding web upload");

  uint8_t* buff = nullptr;
  size_t len = 0;

  decodeBase64(base64Str, &buff, &len);

  String response = "";
  if (buff && len > 0) {
    updateDeviceStatus("Sending web upload to HF");
    response = sendDownloadedImageToHuggingFace(buff, len);
    free(buff);
  } else {
    updateDeviceStatus("Failed to decode base64 image");
  }

  if (response.length() == 0) {
    updateDeviceStatus("Disease API failed for web upload");
    sendTelegramMessage("Disease detection failed for uploaded image.");
    return;
  }

  Serial.println("HF upload response body:");
  Serial.println(response);

  StaticJsonDocument<8192> doc;
  DeserializationError error = deserializeJson(doc, response);
  if (error) {
    updateDeviceStatus("Disease result JSON parse failed");
    Serial.print("JSON parse error: ");
    Serial.println(error.c_str());
    return;
  }

  String label = doc["label"] | "unknown";
  float confidence = doc["confidence"] | 0.0;
  String timestamp = getTimestampString();

  String diseaseJson = "{";
  diseaseJson += "\"label\":\"" + jsonEscape(label) + "\",";
  diseaseJson += "\"confidence\":" + String(confidence, 6) + ",";
  diseaseJson += "\"source\":\"manual upload\",";
  diseaseJson += "\"timestamp\":\"" + jsonEscape(timestamp) + "\"";
  if (STORE_IMAGES_IN_RTDB) diseaseJson += ",\"imageUrl\":\"" + jsonEscape(base64Str) + "\"";
  diseaseJson += "}";

  String tsKey = getTimestampKey();
  firebasePUT("/plant/manual/latest", diseaseJson);
  firebasePUT("/disease/latest", diseaseJson);
  firebasePUT("/disease/history/" + tsKey, diseaseJson);

  String msg = "Manual Plant Upload Result\n";
  msg += "Label: " + label + "\n";
  msg += "Confidence: " + String(confidence, 4) + "\n";
  msg += "Time: " + timestamp;
  sendTelegramMessage(msg);

  updateDeviceStatus("Manual upload processed: " + label);
}

void pollFirebaseCommands() {
  intruderArmed = firebaseGetBool("/control/intruderArmed", false);
  dailyDiseaseActive = firebaseGetBool("/control/dailyDiseaseActive", false);

  String timesStr = firebaseGET("/config/dailyDiseaseTimes");
  timesStr.trim();
  timesStr.replace("\"", "");
  if (timesStr == "null") timesStr = "";
  dailyDiseaseTimes = timesStr;

  if (firebaseGetBool("/commands/diseaseSnap", false)) {
    firebaseSetBool("/commands/diseaseSnap", false);
    runDiseaseDetection("manual");
  }

  if (firebaseGetBool("/commands/intruderSnap", false)) {
    firebaseSetBool("/commands/intruderSnap", false);
    captureIntruder("manual dashboard snap");
  }

  if (firebaseGetBool("/commands/plantManualSnap", false)) {
    firebaseSetBool("/commands/plantManualSnap", false);

    String base64Data = firebaseGET("/commands/plantManualUploadBase64");
    base64Data.trim();

    if (base64Data.startsWith("\"") && base64Data.endsWith("\"")) {
      base64Data = base64Data.substring(1, base64Data.length() - 1);
    }

    base64Data.replace("\\/", "/");

