AbdulraufIbrahim/AgroGuard_AI/esp32_cam_disease_intruder/esp32_cam_disease_intruder.ino
    if (base64Data.length() > 100) {
      processManualPlantUploadBase64(base64Data);
      firebaseSetString("/commands/plantManualUploadBase64", "");
    } else {
      updateDeviceStatus("Manual upload command had no image data");
    }
  }

  time_t nowEpoch = time(nullptr);
  String statusJson = "{";
  statusJson += "\"online\":" + String((WiFi.status() == WL_CONNECTED) ? "true" : "false") + ",";
  statusJson += "\"intruderArmed\":" + String(intruderArmed ? "true" : "false") + ",";
  statusJson += "\"dailyDiseaseActive\":" + String(dailyDiseaseActive ? "true" : "false") + ",";
  statusJson += "\"dailyDiseaseTimes\":\"" + jsonEscape(dailyDiseaseTimes) + "\",";
  statusJson += "\"lastSeen\":\"" + jsonEscape(getTimestampString()) + "\",";
  statusJson += "\"lastSeenEpoch\":" + String((unsigned long)nowEpoch);
  statusJson += "}";
  firebasePUT("/status/device", statusJson);
}

void setup() {
  Serial.begin(115200);
  delay(1000);

  pinMode(PIR_PIN, INPUT);
  pinMode(BUZZER_PIN, OUTPUT);
  pinMode(FLASH_LED_PIN, OUTPUT);
  digitalWrite(BUZZER_PIN, LOW);
  digitalWrite(FLASH_LED_PIN, LOW);

  connectWiFi();
  setupTime();
  setupCamera();
  firebaseEnsureAuth();

  updateDeviceStatus("ESP32-CAM online");
  sendTelegramMessage("ESP32-CAM Disease + Intruder System is online.");
  Serial.println("System ready.");
}

void loop() {
  if (WiFi.status() != WL_CONNECTED) {
    connectWiFi();
  }

  unsigned long now = millis();

  if (now - lastCommandPoll >= commandPollInterval) {
    lastCommandPoll = now;
    pollFirebaseCommands();
  }

  if (dailyDiseaseActive && dailyDiseaseTimes.length() >= 5) {
    time_t tnow = time(nullptr);
    if (tnow > 100000) {
      struct tm* timeinfo = localtime(&tnow);

      char dateBuf[15];
      char timeBuf[10];
      strftime(dateBuf, sizeof(dateBuf), "%Y-%m-%d", timeinfo);
      strftime(timeBuf, sizeof(timeBuf), "%H:%M", timeinfo);

      String currentDate = String(dateBuf);
      String currentTime = String(timeBuf);
      String searchStr = "," + dailyDiseaseTimes + ",";
      String target = "," + currentTime + ",";

      if (searchStr.indexOf(target) >= 0) {
        if (lastSnapDate != currentDate || lastSnapTimeStr != currentTime) {
          lastSnapDate = currentDate;
          lastSnapTimeStr = currentTime;
          runDiseaseDetection("scheduled time " + currentTime);
        }
      }
    }
  }

  if (intruderArmed) {
    int pirState = digitalRead(PIR_PIN);
    if (pirState == HIGH && now - lastIntruderSnap >= intruderCooldownMs) {
      lastIntruderSnap = now;
      captureIntruder("PIR motion");
    }
  }

  delay(100);
}
